In [11]:
import numpy as np

In [12]:
import pandas as pd

In [13]:
df = pd.read_csv(r"C:\Users\gowsi\OneDrive\Documents\top tech-intern\Task 2\bank_loan.csv")

In [14]:
df.head()

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,1,25,1,49,91108,4,1/60,1,0,0,1,0,0,0
1,2,45,19,34,90089,3,1/50,1,0,0,1,0,0,0
2,3,39,15,11,94720,1,1/00,1,0,0,0,0,0,0
3,4,35,9,100,94112,1,2/70,2,0,0,0,0,0,0
4,5,35,8,45,91330,4,1/00,2,0,0,0,0,0,1

In [15]:
df.head(7)

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
0,1,25,1,49,91108,4,1/60,1,0,0,1,0,0,0
1,2,45,19,34,90089,3,1/50,1,0,0,1,0,0,0
2,3,39,15,11,94720,1,1/00,1,0,0,0,0,0,0
3,4,35,9,100,94112,1,2/70,2,0,0,0,0,0,0
4,5,35,8,45,91330,4,1/00,2,0,0,0,0,0,1
5,6,37,13,29,92121,4,0/40,2,155,0,0,0,1,0
6,7,53,27,72,91711,2,1/50,2,0,0,0,0,1,0

In [16]:
df.tail()

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
4995,4996,29,3,40,92697,1,1/90,3,0,0,0,0,1,0
4996,4997,30,4,15,92037,4,0/40,1,85,0,0,0,1,0
4997,4998,63,39,24,93023,2,0/30,3,0,0,0,0,0,0
4998,4999,65,40,49,90034,3,0/50,2,0,0,0,0,1,0
4999,5000,28,4,83,92612,3,0/80,1,0,0,0,0,1,1

In [17]:
df.tail(5)

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
4995,4996,29,3,40,92697,1,1/90,3,0,0,0,0,1,0
4996,4997,30,4,15,92037,4,0/40,1,85,0,0,0,1,0
4997,4998,63,39,24,93023,2,0/30,3,0,0,0,0,0,0
4998,4999,65,40,49,90034,3,0/50,2,0,0,0,0,1,0
4999,5000,28,4,83,92612,3,0/80,1,0,0,0,0,1,1

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  5000 non-null   int64
 1   Age                 5000 non-null   int64
 2   Experience          5000 non-null   int64
 3   Income              5000 non-null   int64
 4   ZIP Code            5000 non-null   int64
 5   Family              5000 non-null   int64
 6   CCAvg               5000 non-null   object
 7   Education           5000 non-null   int64
 8   Mortgage            5000 non-null   int64
 9   Personal Loan       5000 non-null   int64
 10  Securities Account  5000 non-null   int64
 11  CD Account          5000 non-null   int64
 12  Online              5000 non-null   int64
 13  CreditCard          5000 non-null   int64
dtypes: int64(13), object(1)
memory usage: 547.0+ KB

In [19]:
df.info(8)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   ID                  5000 non-null   int64
 1   Age                 5000 non-null   int64
 2   Experience          5000 non-null   int64
 3   Income              5000 non-null   int64
 4   ZIP Code            5000 non-null   int64
 5   Family              5000 non-null   int64
 6   CCAvg               5000 non-null   object
 7   Education           5000 non-null   int64
 8   Mortgage            5000 non-null   int64
 9   Personal Loan       5000 non-null   int64
 10  Securities Account  5000 non-null   int64
 11  CD Account          5000 non-null   int64
 12  Online              5000 non-null   int64
 13  CreditCard          5000 non-null   int64
dtypes: int64(13), object(1)
memory usage: 547.0+ KB

In [20]:
df.shape

(5000, 14)

In [21]:
df.columns

Index(['ID', 'Age', 'Experience', 'Income', 'ZIP Code', 'Family', 'CCAvg',
       'Education', 'Mortgage', 'Personal Loan', 'Securities Account',
       'CD Account', 'Online', 'CreditCard'],
      dtype='object')

In [22]:
df.describe()

,ID,Age,Experience,Income,ZIP Code,Family,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.00000,5000.000000,5000.000000
mean,2500.500000,45.338400,20.104600,73.774200,93152.503200,2.396400,1.881000,56.498800,0.096000,0.104400,0.06040,0.596800,0.294000
std,1443.520003,11.463166,11.467954,46.033729,2121.852005,1.147663,0.839869,101.713802,0.294621,0.305809,0.23825,0.490589,0.455637
min,1.000000,23.000000,-3.000000,8.000000,9307.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000
25%,1250.750000,35.000000,10.000000,39.000000,91911.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.00000,0.000000,0.000000
50%,2500.500000,45.000000,20.000000,64.000000,93437.000000,2.000000,2.000000,0.000000,0.000000,0.000000,0.00000,1.000000,0.000000
75%,3750.250000,55.000000,30.000000,98.000000,94608.000000,3.000000,3.000000,101.000000,0.000000,0.000000,0.00000,1.000000,1.000000
max,5000.000000,67.000000,43.000000,224.000000,96651.000000,4.000000,3.000000,635.000000,1.000000,1.000000,1.00000,1.000000,1.000000

In [30]:
df['ID']

0          1
1          2
2          3
3          4
4          5
        ...
4995    4996
4996    4997
4997    4998
4998    4999
4999    5000
Name: ID, Length: 5000, dtype: int64

In [31]:
df[['ID', 'Age']]

        ID  Age
0        1   25
1        2   45
2        3   39
3        4   35
4        5   35
...    ...  ...
4995  4996   29
4996  4997   30
4997  4998   63
4998  4999   65
4999  5000   28

[5000 rows x 2 columns]

In [32]:
df.iloc[0]

ID                        1
Age                      25
Experience                1
Income                   49
ZIP Code              91108
Family                    4
CCAvg                  1/60
Education                 1
Mortgage                  0
Personal Loan             0
Securities Account        1
CD Account                0
Online                    0
CreditCard                0
Name: 0, dtype: object

In [33]:
df.loc[0]

ID                        1
Age                      25
Experience                1
Income                   49
ZIP Code              91108
Family                    4
CCAvg                  1/60
Education                 1
Mortgage                  0
Personal Loan             0
Securities Account        1
CD Account                0
Online                    0
CreditCard                0
Name: 0, dtype: object

In [34]:
df[df['Age'] > 25]

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
1,2,45,19,34,90089,3,1/50,1,0,0,1,0,0,0
2,3,39,15,11,94720,1,1/00,1,0,0,0,0,0,0
3,4,35,9,100,94112,1,2/70,2,0,0,0,0,0,0
4,5,35,8,45,91330,4,1/00,2,0,0,0,0,0,1
5,6,37,13,29,92121,4,0/40,2,155,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,29,3,40,92697,1,1/90,3,0,0,0,0,1,0
4996,4997,30,4,15,92037,4,0/40,1,85,0,0,0,1,0
4997,4998,63,39,24,93023,2,0/30,3,0,0,0,0,0,0
4998,4999,65,40,49,90034,3,0/50,2,0,0,0,0,1,0
4999,5000,28,4,83,92612,3,0/80,1,0,0,0,0,1,1

In [45]:
df[(df['Age'] > 20) & (df['Age'] < 30)]

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard,City
0,1,26,1,49,91108,4,1/60,1,0,0,1,0,0,0,Chennai
58,59,29,2,93,94065,2,0/20,1,0,0,0,0,0,0,Chennai
74,75,29,3,135,94611,2,3/30,1,0,0,0,0,0,1,Chennai
85,86,28,2,109,94005,4,1/80,3,0,0,0,0,0,0,Chennai
89,90,26,-1,113,94303,4,2/30,3,0,0,0,0,0,1,Chennai
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4941,4942,29,4,112,90049,2,1/60,2,0,1,0,0,1,0,Chennai
4943,4944,27,0,12,96003,1,0/10,2,0,0,0,0,1,0,Chennai
4984,4985,28,1,98,94043,4,2/30,3,0,0,0,0,0,1,Chennai
4989,4990,25,0,38,93555,1,1/00,3,0,0,0,0,1,0,Chennai
4999,5000,29,4,83,92612,3,0/80,1,0,0,0,0,1,1,Chennai

In [46]:
df['Age'] = df['Age'] + 1

In [47]:
df.drop('City', axis=1, inplace=True)

In [48]:
df.drop(0, axis=0, inplace=True)

In [49]:
(df.sort_values('Age'))

        ID  Age  Experience  Income  ZIP Code  Family CCAvg  Education  \
909    910   25          -1     149     91709       1  6/33          1
3824  3825   25          -1      12     95064       4  1/00          1
2717  2718   25          -2      45     95422       4  0/60          2
4285  4286   25          -3     149     93555       2  7/20          1
670    671   25          -1      61     92374       4  2/60          1
...    ...  ...         ...     ...       ...     ...   ...        ...
4172  4173   69          42      75     90041       4  0/10          2
4451  4452   69          41      18     92130       2  0/40          1
3331  3332   69          42      21     94607       3  0/10          3
4468  4469   69          42      51     94117       3  2/20          1
3703  3704   69          41      78     94301       4  2/40          3

      Mortgage  Personal Loan  Securities Account  CD Account  Online  \
909        305              0                   0           0       0
3824         0              0                   1           0       0
2717         0              0                   0           0       1
4285         0              0                   0           0       1
670        239              0                   0           0       1
...        ...            ...                 ...         ...     ...
4172       182              0                   0           0       1
4451         0              0                   0           0       1
3331         0              0                   0           0       0
4468         0              0                   0           0       1
3703         0              0                   1           0       0

      CreditCard
909            1
3824           1
2717           1
4285           0
670            0
...          ...
4172           0
4451           0
3331           1
4468           1
3703           0

[4999 rows x 14 columns]

In [51]:
(df.sort_index())

,ID,Age,Experience,Income,ZIP Code,Family,CCAvg,Education,Mortgage,Personal Loan,Securities Account,CD Account,Online,CreditCard
1,2,47,19,34,90089,3,1/50,1,0,0,1,0,0,0
2,3,41,15,11,94720,1,1/00,1,0,0,0,0,0,0
3,4,37,9,100,94112,1,2/70,2,0,0,0,0,0,0
4,5,37,8,45,91330,4,1/00,2,0,0,0,0,0,1
5,6,39,13,29,92121,4,0/40,2,155,0,0,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,4996,31,3,40,92697,1,1/90,3,0,0,0,0,1,0
4996,4997,32,4,15,92037,4,0/40,1,85,0,0,0,1,0
4997,4998,65,39,24,93023,2,0/30,3,0,0,0,0,0,0
4998,4999,67,40,49,90034,3,0/50,2,0,0,0,0,1,0
4999,5000,30,4,83,92612,3,0/80,1,0,0,0,0,1,1

In [80]:
df['Family']

1       3
2       1
3       1
4       4
5       4
       ..
4995    1
4996    4
4997    2
4998    3
4999    3
Name: Family, Length: 4999, dtype: int64

In [83]:
df['Income']

1        34
2        11
3       100
4        45
5        29
       ...
4995     40
4996     15
4997     24
4998     49
4999     83
Name: Income, Length: 4999, dtype: int64

In [68]:
print(df.isnull())

         ID    Age  Experience  Income  ZIP Code  Family  CCAvg  Education  \
1     False  False       False   False     False   False  False      False
2     False  False       False   False     False   False  False      False
3     False  False       False   False     False   False  False      False
4     False  False       False   False     False   False  False      False
5     False  False       False   False     False   False  False      False
...     ...    ...         ...     ...       ...     ...    ...        ...
4995  False  False       False   False     False   False  False      False
4996  False  False       False   False     False   False  False      False
4997  False  False       False   False     False   False  False      False
4998  False  False       False   False     False   False  False      False
4999  False  False       False   False     False   False  False      False

      Mortgage  Personal Loan  Securities Account  CD Account  Online  \
1        False          False               False       False   False
2        False          False               False       False   False
3        False          False               False       False   False
4        False          False               False       False   False
5        False          False               False       False   False
...        ...            ...                 ...         ...     ...
4995     False          False               False       False   False
4996     False          False               False       False   False
4997     False          False               False       False   False
4998     False          False               False       False   False
4999     False          False               False       False   False

      CreditCard  Salary
1          False   False
2          False   False
3          False   False
4          False   False
5          False   False
...          ...     ...
4995       False   False
4996       False   False
4997       False   False
4998       False   False
4999       False   False

[4999 rows x 15 columns]

In [85]:
df1 = pd.DataFrame({'ID':[1,2,3], 'Name':['A','B','C']})

In [86]:
df2 = pd.DataFrame({'ID':[1,2,3], 'Marks':[90,85,95]})

In [87]:
merged = pd.merge(df1, df2, on='ID')

In [88]:
print(merged)

   ID Name  Marks
0   1    A     90
1   2    B     85
2   3    C     95

In [89]:
concat = pd.concat([df1, df2], axis=0)

In [90]:
print(concat)

   ID Name  Marks
0   1    A    NaN
1   2    B    NaN
2   3    C    NaN
0   1  NaN   90.0
1   2  NaN   85.0
2   3  NaN   95.0

In [91]:
df.to_excel('output.xlsx', index=False)

In [92]:
df.to_json('output.json', orient='records')